<template>
  <div class="ssign">
    <pre>
    <h2>SKIN BOX DATA软件系统使用许可协议</h2>

    <strong>授权方：</strong>上海善真科技有限公司
    <strong>地址：</strong>上海闵行区合川路3051号莱茵虹桥中心B栋315室
    <strong>电话：</strong>+86 21 54325558

    <strong>使用方：</strong>{{shopInfo.shop_name}}
    <strong>地址：</strong>{{shopInfo.address}}
    <strong>电话：</strong>{{shopInfo.mobile}}

      本合同基于双方于 {{startTime}}签订的《SKIN BOX美妆连锁店特许加盟经营合同》而建立的合作关系， 授权方“上海善真科技有限公司”是SKIN BOX中国项目的运营商，和《SKIN BOX美妆连锁店特许加盟经营合同》的“总部”为同一人；使用方为SKIN BOX软件系统（详见下）使用人，和《SKIN BOX美妆连锁店特许加盟经营合同》的“加盟商”为同一人，双方签署的本协议涉及的系统只使用于使用人加盟经营的位于 {{shopInfo.address}} 的“SKIN BOX美妆连锁店“，连锁店编号第 {{shopInfo.shop_code}} 号。
      鉴于授权方从事连锁经营事业，开发了拥有自主知识产权的软件系统，包括但不限于已经上线使用的《SKIN BOX连锁商业管理系统》和将要上线使用的《SKIN BOX会员服务系统》、《SKIN BOX百分宝系统》、《SKIN BOX脸谱识别支付系统》、《SKIN BOX网上商城系统》等系列计算机软件系统，统称《SKIN BOX计算机软件系统》，以下简称“系统“；
      鉴于使用方同意在授权方的许可授权下使用上述计算机软件系统从事SKIN BOX经营活动并接受本合同条款约束；
      鉴于上述系统的授权并许可使用有助于授权方及其SKIN BOX连锁经营门店的规范经营、防范风险、提高效率，促进SKIN BOX美妆经营事业健康持续发展；
      按照平等互利的原则，经双方友好协商，使用方已决定其愿成为授权方拥有的上述系统的许可使用人，而授权方愿意在授权时间内授权上述系统给使用方许可使用。
      鉴于本协议中所含的所有条款都被双方充分理解、接受并愿意遵照执行，详细规定如下：

    <strong>1．定义</strong>
    下列特别词语在本协议中应有如下含义：
    1.1、系统：
    除明确界定说明的系统外，均指《SKIN BOX计算机软件系统》，指上海善真科技有限公司为从事经营，而自主开发的或与其他人合作开发的、或委托其他计算机软件公司开发的拥有自主知识产权及使用权的《SKIN BOX连锁管理系统》、《SKIN BOX会员服务系统》、《SKIN BOX百分宝系统》、《SKIN BOX脸谱识别支付系统》、《SKIN BOX网上商城系统》等系列计算机软件系统；
    1.2、控制用计算机：指由使用方用于SKIN BOX计算机软件系统及其所控制的一切从事SKIN BOX经营事业的计算机系统组成部分，包括但不限于收银机主机及附属设备，以及授权方要求可能存在的监控系统计算机、运行计算机等；

   <strong> 2、系统的提供</strong>
    2.1、授权方根据SKIN BOX连锁店店铺运营需要向使用方出租系统，该软件所有权为授权方所有，使用方在加盟期内租用该系统和软件，接受总部的系统维护和升级服务。除另行商定外，系统租金和升级研发费用包含在使用方向授权方每月缴纳的连锁费中（详见《SKIN BOX美妆连锁店特许加盟经营合同》）。
    2.2、使用方无条件接受授权方对其系统使用的监督权和对非法操作的整改要求。
    2.3、使用方同意并接受使用，授权方可以自行决定，通过改进升级租赁给使用方的系统，提供更新的系统或者将前述几个系统结合起来，用于SKIN BOX连锁经营。
    2.4、使用方不得以任何理由对软件或系统或设备实施中止使用、离线（中断联网）使用、和其他收银软件或设备同时使用、篡改软件、外接非法设备等行为。
    2.5、使用方不得以任何理由在授权方门店里安装除亿百葩藓以外的其它任何收银系统，无论是否使用或给与任何人是否使用。
    
    <strong>3、系统使用的要求保证</strong>
    3.1、授权方声明并保证：授权方是本协议中向使用方许可、租赁或销售的包括系统在内的一切知识产权的所有人，并且授权方有权向使用方许可、租赁或销售前述知识产权。授权方保证本协议项下提供的系统和一切设备及有关软件能够为SKIN BOX业务所使用。授权方在该期间内有权在使用方场地进行检查、下载、更新、修理、更换并重新安装系统或修复其任何有瑕疵的部分。如果由于保证范围外的瑕疵或正常使用和常规安装外的原因导致修理和更换，使用方应对授权方为纠正该等瑕疵所提供的一切劳务和物资（包括差旅费、误工费等）向授权方支付费用。
    3.2、本合同规定的保证仅适用于常规安装、正常使用并在保证期内发现瑕疵的物品。该等保证不应适用于未经授权方书面同意而修改、改动或者被滥用、发生事故、过失或不当使用的物品，也不适用于本合同第2.3、2.4、2.5条所包括的内容。
    3.3、授权方在任何时候都不对使用方在使用过程中出现的数据丢失或故障、联网中断或者任何种类或性质的特殊、间接或结果性损害负责。
    3.4、授权方系统的开发、升级、更新、修补是长期、持续、甚至是永远的工作，在双方合作的时期内，确保无间断（指365天，每天24小时）的联网和实时数据交换，使用方才能及时获得系统更新抵御病毒获得安全运行环境和避免病毒侵入联网系统，授权方方能根据使用方销售和库存数据安排合理备货和配货。鉴于此，使用方已经充分理解并支持授权方关于无间断联网和实时数据交换的要求，理解并支持建立SKIN BOX大数据中心的意义和工作，在此使用方保证将确保系统无间断联网以确保每天的数据交换和软件及时下载更新，使用方对系统的无间断联网和数据交换的稳定运行负全部责任，为此使用方需要采取包括使用独立的不间断的网络线路等措施来确保系统无间断联网，并且保证数据的实时交换和系统及时更新。
    3.5、使用方已经完全知晓系统具有的自动保护功能，自动保护功能包括系统在断网运行或数据交换中断或系统无法更新的情况下（一般为72小时）会自动停止运行或无法开机，系统一旦停止运行将导致使用方出现无法启动收银系统、无法打开收银机、无法接受总部任何工作指令、无法在系统中订货、无法启动监控报警设备、无法使用会员服务系统等情况，所造成的一切责任和损失均由使用方自行承担。
    因特殊情况导致网络不通或将要导致网络中断的，使用方应提前与授权方报告并及时采取更换线路、使用无限网络等方法抢修，否则，由此产生的一切损失和可能需要授权方派员上门维修的费用都由使用方承担。
    3.6、授权方保证在可转让的范围内向使用方转让任何控制用计算机生产厂商对计算机及控制用计算机操作系统软件（如有）的质量和维修保证。
    3.7 使用方保证积极推广及使用授权方提供的系统，确保系统每个月的有效使用次数不低于 次或符合授权方另行发出的使用频率书面要求。授权方有权对使用方的使用频率进行监督考察，连续 月使用次数低于约定次数或不符合授权方书面要求的，授权方有权单方面解除本协议并要求使用方支付违约金人民币 元3.8 使用方保证，授权方因使用方的任何违法违规行为或不当行为遭受任何第三方追责、索赔的，或使用方有下列情形之一的，授权方有权单方面解除本协议并要求使用方承担全部赔偿责任，包括但不限于授权方向第三方支付的赔偿款、违约金及授权方遭受的其他全部损失：
    1)使用方发生伪盗刷卡事件；
    2)使用方虚假申请；
    3)使用方失联；
    4)使用方无法在授权方指定时间内提供有效调单凭证；
    5)使用方将授权方支付终端用于非法经营活动；
    6）使用方安装可移动的银行卡、条码支付受理终端的，不在限定使用区域范围内使用；
    7)直接或间接参与欺诈的；
    8)发生伪冒交易或恶意欠款的；
    9)使用方隐瞒实际经营情况，对资质材料进行伪装作假；
    10)使用方不实宣传和承诺；
    11)使用方展示的条码，非当次支付相关的使用方、商品（服务）或商品（服务）订单等信息。
    12)出现违规操作，经通知后无正当理由拒不纠正的；
    13)违背监管机构政策的行为；
    14)无理拒绝或故意拖延授权方查询和监查要求的；
    15)进入破产程序、解散、营业执照被吊销；
    16)有充足证据证明实施有损授权方合法利益行为的；
    17)经营及财务状况恶化无法正常经营；
    18)其他为违反法律、法规、行业规则或者为授权方带来风险的行为。
    
    <strong>4．系统的权限和使用许可</strong>
    4.1、系统操作所需的权限等级和种类由授权方根据业务需要向使用方提供。
    4.2、权限只限于经过授权方培训合格的使用方工作人员操作使用，不得授权其他人使用。任何非合格系统操作员的系统操作均被认定为非法操作，由于非法操作造成的系统软硬件损坏由使用方承担。
    4.3、本合同没有给与使用人任何系统的所有权、知识产权或技术的再许可权、分许可权、转让或转移权、转售权。在本合同项下，亦不能从中推断出或暗示有以上权利，使用人无任何权利对任何人进行本合同涉及的系统的转让、许可使用、买卖等，无论是否获利或为了有利经营。
    
    <strong>5．系统的安全要求</strong>
    5.1、使用方同意授权方制定的系统的安全规定，为防止系统在装运、储存、操作或双方进行与本合同有关的其他活动期间（包括保证期和保证期后）被盗窃或有其他泄露，使用方同意采用和遵守授权方的系统安全规定，包括授权方不定期的替代和补充安全要求。
    5.2、使用方若在授权方提供的收银机上私自安装非预装软件，授权方有权对其进行非通知性删除，若因私自按装软件造成系统无法使用或电脑死机，中间产生的维护费由门店自行负责。
    
    <strong>6．违反系统使用的处罚</strong>
    使用方违反本合同或违反同时签署的《SKIN BOX美妆连锁店特许加盟经营合同》内有关系统的规定，需接受授权方开出的处罚决定或罚单，包括但不限于以下内容：
    6.1、使用方中断联网或无法稳定传输数据或无法进行系统更新的，并且不能在72小时内修复的，授权人有权派员上门检查或修复，使用方除需要承担授权方上门修复费（包括差旅费、工时费、网络设备费等）外，还将被授权方收取违约金不低于2万元/每次，同时，前述情况因使用方故意而出现的，授权方有权选择行使单方面终止本合同的权力，届时使用方除应支付前述违约金外，应另行向授权方支付违约金10万元，并赔偿授权方全部损失；
    6.2、使用方擅自篡改系统或软件，或非法外接设备传输或运算客户资料，或同时使用其他收银软件或设备，无论是否造成SKIN BOX联网系统被侵入病毒或受损或数据丢失，均被视为严重违约行为，每次被授权方查实时，使用方需无条件接受不低于5万元的违约金并立即按照授权方要求整改到位，否则授权方有权终止本合同，但合同终止并不表示使用方可以免除以上违约金，相反，使用方还需向授权方缴纳违约金金额逾期缴纳所产生的每日千分之五的滞纳金；同时，前述情况出现两次或两次以上的，授权方有权选择行使单方面终止本合同的权力，届时使用方除应支付前述违约金外，应另行向授权方支付违约金10万元，并赔偿授权方全部损失；
    6.3、如果使用方疏忽或不按时支付系统租金（含在连锁费中或商定另行缴纳），而且该情形在书面通知使用方后7个工作日内未获补救，使用方需无条件接受不低于应缴租金10倍的违约金并按照授权方要求在7个工作日内缴纳到位，否则授权方应有权终止本合同，但合同终止并不表示使用方可以免除以上违约金，相反，使用方还需向授权方缴纳违约金金额逾期缴纳所产生的每日千分之五的滞纳金；
    6.4、由于使用方过错造成授权方终止本合同的，意味着授权方终止使用方的SKIN BOX连锁店的连锁经营为不得已行为，这将给授权方造成诸多损失，这些损失包括但不限于为使用方门店投入的系统费用投入、支持开店前期投入的人力等费用、贴补给使用方的促销品或促销费、失去门店进货而减少的利润、失去授权方应得的连锁费和广告费等，为此，如果授权方向使用方追讨损失，使用方需要向授权方赔偿不低于50万元的经济损失。
    
    <strong>7．保密</strong>
    使用方同意使用采取至少与使用方使用于自身专有资料相同的谨慎与防范措施，对授权方向使用方透露的、包含专有资料并标明“SKIN BOX”、“专有”或“保密”的任何资料或数据，如授权方的图纸和软件（包括但不限于本合同、门店设计、评估报告、配货数据、软件文件、运营手册、系统模型等等）予以保密，但无论如何，谨慎不得低于合理程度。未经授权方书面允许，不得复制、向他人透露或者使用该等资料、资讯或数据。
    7.1、双方对在本合同签订、履行过程中知悉的对方资料和信息，除该方作出相反的书面说明外，均应视为该方的商业秘密，未经该方书面同意不得向任何第三方泄漏。任何一方因违反保密义务而给另一方造成损失的，应负相应的赔偿责任。不论本合同是否解除或终止，本条款在保密期限内持续有效，保密期限为终生，自本合同签署之日起算。
    7.2、除在本合同中有明确规定，双方同意，授权方对保密或专有资料的透露并不意味向使用方授予授权方任何专利、商业秘密或版权的许可。
    7.3、任何一方未经另一方每次书面明示同意，不得在推售、广告、公关活动中或以任何其他形式，使用另一方、其母公司、子公司、其他关联公司的名称或者任何商标或商号（或象征）。
    
    <strong>8．不可抗力</strong>
    “不可抗力”指自然现象、火灾、意外事故、火灾、地震、罢工或工厂关闭、骚乱、暴动或动乱、禁运、战争，任何将来的法律、命令、法规或其他政府行为，运输迟延、能源短缺、原料短缺或在授权方合理控制之外的供应商缺货或延迟交货。如果不可抗力的原因阻止、限制、延迟或干扰授权方履行本合同，则应免除授权方对不可抗力所延迟或阻止的部分的履行，但是，授权方应采取合理的措施尽量避免或消除该等造成不履行的原因，并且一旦该等原因被消除，则授权方应继续履行原受被消除原因影响的条款。
    
    <strong>9．终止</strong>
    除使用方违反本合同导致授权方终止合同的情况外，如果发生下列情况，使用方或授权方均有权终止本合同，终止本合同即意味着授权方终止使用方使用本合同涉及的所有系统，同时意味着使用方必须停止使用本合同涉及的所有授权方系统：
    9.1、因不可抗力而无法继续履行本合同；
    9.2、合同期限届满或双方协商一致终止本合同；
    9.3、总部与加盟商签署的《SKIN BOX美妆连锁店特许加盟经营合同》任何原因的终止；
    9.4、一方宣告破产或宣告解散或法院、政府行政决定要求本合同任何一方终止营业；
    9.5、加盟商连续3年发生经营亏损而无法继续履行《SKIN BOX美妆连锁店特许加盟经营合同》和本合同；
    9.6、因一方违约行为而被法院裁决解除本合同；
    9.7、本合同任何一方用于特许经营的主要资产被法院强制执行而不能继续履行合同的；
    
    <strong>10．合同终止的执行</strong>
    10.1 使用方要求终止本合同的，应当向授权方发出书面通知，说明终止合同的理由，并与授权方协商达成一致意见，方可终止本合同。因使用方违反本合同有关条款，授权方要求终止本合同的，应当向使用方发出书面通知，说明终止合同的理由，合同即行终止。
    10.2 无论对方是否发生足以解除合同的违约行为，授权方或使用方违反上述规定终止本合同履行的，视为其单方违约解除合同，需承担全部违约责任，向守约方支付违约金10万元，并赔偿守约方的全部损失。
    10.3、无论在任何情况下终止本合同，除本合同另有规定之外，在本合同终止后30日内，使用方应当履行下列义务并完成以下工作：
    10.3.1、停止行使因本合同享有的权利；
    10.3.2、在授权方派员现场监督下卸载授权方系统并删除所有数据；
    10.3.3、将与SKIN BOX特许经营系统有关的系统使用手册、培训材料、授权以及其他涉及授权方商业秘密的文件等交还授权方；
    10.3.4、使用方未履行本条款义务或因任何原因不能完成上述工作时，授权方有权自行执行，所需费用由使用方负担，包括但不限于人员差旅费和工时费等。
    
    <strong>11．不放弃权利</strong>
    本合同一方免予追究对本合同任何条款的违反或不履行、或一方一次或多次未执行本合同的任何条款或行使本合同项下的任何权利或特权，均不得被解释为对任何随后的违反或不履行不予追究、或对本合同项下任何该等条款、权利或特权的放弃。
    
    <strong>12．合同有效期与生效</strong>
    12.1、本协议的期限和使用方签署的《SKIN BOX美妆连锁店特许加盟经营合同》的期限相同，自{{startTime}}起生效，至{{endTime}}止，有效期1年。如果加盟商满足续约条件（第13条）的要求，则本合同可以延长1年，依此类推。
    12.2、本合同一式四份，双方各持两份，均具有同等效力，本合同在双方签章后，在使用方和授权方签署的《SKIN BOX美妆连锁店特许加盟经营合同》正式生效后生效；如果《SKIN BOX美妆连锁店特许加盟经营合同》在约定时间内没有正式生效，本合同也自行失效，无论使用方是否开始投入资金建店或经营都必须立即停止一切和SKIN BOX有关的行为，使用方自行承担全部损失，并对涉及SKIN BOX品牌或经营所可能产生的影响承担责任。
    
    <strong>13、续约条件</strong>
    在本合同期限届满时，使用方应当满足下列续约条件：
    13.1、履行了本合同的责任和义务，没有发生过严重违约行为；
    13.2、《SKIN BOX美妆连锁店特许加盟经营合同》得以续签；
    13.3、已经向授权方支付了全部系统使用租金；
    13.4、和授权方之间没有任何经济和法律纠纷，或签署放弃可能向授权方主张经济和法律责任或损失的文件；
    13.5、接受并签署授权方可能有更新的《SKIN BOX计算机软件系统使用许可协议》及附属协议（如有）的所有内容；
    
    <strong>14、争议的解决</strong>
    14.1、协商：
    14.1.1、授权方和使用方均已充分地认识到，在长期的合作中产生争议是不可避免的，协商是解决争议的最佳方式，双方均愿意本着公平的原则与合作的态度解决发生的争议，共求发展。
    14.1.2、争议的搁置：双方同意，即使协商结果不一定令双方满意，但双方应同意可以暂时搁置一些难以解决的分歧，目的是保证这些分歧不会给双方的经营带来负面影响。
    14.2、诉讼
    授权方对使用方严重因违反本合同造成的合同终止，授权方追诉经济赔偿等的，或者双方存在无法协调一致的分歧，双方均可以选择向上海市闵行区人民法院提起诉讼。
    14.3、诉讼费用
    14.3.1、依据本合同规定提起的诉讼，败诉的一方应负担胜诉方因此而发生的合理的开支，包括律师费、调查费、鉴定费、公证费、差旅费及其他相关费用。
    14.3.2、上述费用的负担，可以在提起诉讼时一并提出，也可以在案件裁决或诉讼之后向对方提出付费要求。

    <strong>授权方：</strong>上海善真科技有限公司
    有权签字人签字：＿＿＿＿＿＿
    姓名：＿＿＿＿＿＿
    日期：{{startTime}}

    <strong>使用方：</strong>{{shopInfo.shop_name}}
    有权签字人签字：<span v-show="!is_sign">＿＿＿＿＿＿</span><span v-show="is_sign"><img :src="pic|imgUrl" alt class="photo" /></span>
    姓名：{{shopInfo.owner_name}}
    日期：{{startTime}}
    </pre>
    <div class="btn">
      <el-button type="primary" @click="toSign" v-show="!is_sign">点击此处签名</el-button>
      <el-button type="primary" @click="enter" v-show="is_sign">进入系统</el-button>
      <el-button>返回</el-button>
    </div>
  </div>
</template>

<script>
import moment from 'moment'
export default {
  components: {},
  props: {},
  data () {
    return {
      storeid: sessionStorage.getItem('storeid'),
      shopInfo: '',
      is_sign: false,
      startTime: '',
      endTime: ''
    }
  },
  methods: {
    toSign () {
      this.$router.push({ name: 'sign' })
    },
    enter () {
      sessionStorage.setItem('shopInfo', JSON.stringify(this.shopInfo))
      sessionStorage.setItem('shoptype', this.shopInfo.type_id)
      this.$router.push({ name: 'Home' })
    },
    async getInfo () {
      const res = await this.$axios.get('/api?datatype=more&storeid=' + this.storeid)
      if (res.data.code == 1) {
        this.shopInfo = res.data.data
      }
    }
  },
  created () {
    if (!this.storeid) return this.$router.push({ name: 'login' })
    let date = moment().format('YYYY 年 MM 月 DD 日')
    let date1 = moment().add('1', 'years').subtract('1', 'days').format('YYYY 年 MM 月 DD 日')
    this.startTime = date
    this.endTime = date1
    this.getInfo()
    let flag = sessionStorage.getItem('signPhoto')
    if (flag) {
      this.is_sign = true
      this.pic = flag
    }
  },
  mounted () { },
  watch: {},
  computed: {}
}
</script>

<style lang="scss" scoped>
.ssign {
  // padding-left: 0;
  padding: 20px 50px;
  height: 100%;
  z-index: 999;
  overflow-y: auto;
  background-color: #fff;
  position: fixed;
  width: 100%;
  font-size: 14px;
  h2 {
    width: 100%;
    text-align: center;
  }
  .btn {
    display: flex;
    justify-content: space-around;
  }
  .photo {
    width: 100px;
    height: 30px;
  }
}
</style>
